# TextBox Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TextBox Methods
TextBox Class See Also
---
The TextBox type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equals | Determines whether the specified Object is equal to the current Object.  (Inherited from RibbonItem.) |
| GetContextualHelp | Gets the contextual help bound with this control. (Inherited from RibbonItem.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetContextualHelp | Sets the contextual help bound with this button. (Inherited from RibbonItem.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
TextBox Class
Autodesk.Revit.UI Namespace